leetcode_2242_maximum_score_of_a_node_sequence.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 2242. Maximum Score of a Node Sequence</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><a href="index.html">Problem Solving</a></nav><div id="content" class="content">
<h1 class="title">Leetcode: 2242. Maximum Score of a Node Sequence</h1>
<ul class="org-ul">
<li><a href="how_can_we_find_the_solution_knowing_part_of_it.html#ID-DD73E390-3303-40F8-9CE1-D1ED048D9588">How can we find the solution knowing part of it?</a>  Be \((u, v)\) the central edge of the maximum path.  We have to find its extreme vertices \(p\) and \(q\), since the maximum path must have length 4.  We can find those vertices by searching through the top-4 vertices connected with \(u\) and \(v\).  Time and space complexity is \(O(n)\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List
<span style="font-weight: bold;">from</span> heapq <span style="font-weight: bold;">import</span> heappush, heappop


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">maximumScore</span>(<span style="font-weight: bold;">self</span>, scores: List[<span style="font-weight: bold;">int</span>], edges: List[List[<span style="font-weight: bold;">int</span>]]) -&gt; <span style="font-weight: bold;">int</span>:
        N = <span style="font-weight: bold;">len</span>(scores)
        <span style="font-weight: bold; font-style: italic;">candidates</span> = [[] <span style="font-weight: bold;">for</span> _ <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N)]

        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">add_candidate</span>(u, v):
            heappush(candidates[u], (scores[v], v))
            <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">len</span>(candidates[u]) &gt; 4:
                heappop(candidates[u])

        <span style="font-weight: bold;">for</span> u, v <span style="font-weight: bold;">in</span> <span style="font-weight: bold; font-style: italic;">edges</span>:
            add_candidate(u, v)
            add_candidate(v, u)

        ans = -1
        <span style="font-weight: bold;">for</span> u, v <span style="font-weight: bold;">in</span> edges:
            <span style="font-weight: bold;">for</span> pscore, p <span style="font-weight: bold;">in</span> candidates[u]:
                <span style="font-weight: bold;">if</span> p == v:
                    <span style="font-weight: bold;">continue</span>
                <span style="font-weight: bold;">for</span> qscore, q <span style="font-weight: bold;">in</span> candidates[v]:
                    <span style="font-weight: bold;">if</span> q == u <span style="font-weight: bold;">or</span> q == p:
                        <span style="font-weight: bold;">continue</span>
                    ans = <span style="font-weight: bold;">max</span>(ans, pscore + qscore + scores[u] + scores[v])
        <span style="font-weight: bold;">return</span> ans


<span style="font-weight: bold;">assert</span> (
    Solution().maximumScore(
        [5, 2, 9, 8, 4], [[0, 1], [1, 2], [2, 3], [0, 2], [1, 3], [2, 4]]
    )
    == 24
)
<span style="font-weight: bold;">assert</span> (
    Solution().maximumScore([9, 20, 6, 4, 11, 12], [[0, 3], [5, 3], [2, 4], [1, 3]])
    == -1
)
</pre>
</div>
</div>
</body>
</html>